=====
Single line
=====

>>> {tag} ID "foo" == (\x -> x) "foo" => "foo" <<<

---

(program
  (block
    (block_start)
    (block_tag
      (identifier)
    )
    (expression
      (func_identifier)
      (string)
    )
    (alpha_convert)
    (expression
      (group
        (function
          (func_indicator)
          (identifier)
          (func_sep)
          (func_body
            (identifier)
          )
        )
      )
      (string)
    )
    (beta_reduce)
    (expression
      (string)
    )
    (block_end)
  )
)


=====
Single line no separators
=====

>>> ID "foo" (\x -> x) "foo" "foo" <<<

---

(program
  (block
    (block_start)
    (expression
      (func_identifier)
      (string)
      (group
        (function
          (func_indicator)
          (identifier)
          (func_sep)
          (func_body
            (identifier)
          )
        )
      )
      (string)
      (string)
    )
    (block_end)
  )
)


=====
Single line only ; separators
=====

>>> ID "foo"; (\x -> x) "foo"; "foo" <<<

---

(program
  (block
    (block_start)
    (expression
      (func_identifier)
      (string)
    )
    (expression
      (group
        (function
          (func_indicator)
          (identifier)
          (func_sep)
          (func_body
            (identifier)
          )
        )
      )
      (string)
    )
    (expression
      (string)
    )
    (block_end)
  )
)


=====
Multi line
=====

>>>>>>>>>>>>> { tag }

ID "foo"

== (\x -> x) "foo"

=> "foo"

<<<<<<<<<<<<<

---

(program
  (block
    (block_start)
    (block_tag
      (identifier)
    )
    (expression
      (func_identifier)
      (string)
    )
    (alpha_convert)
    (expression
      (group
        (function
          (func_indicator)
          (identifier)
          (func_sep)
          (func_body
            (identifier)
          )
        )
      )
      (string)
    )
    (beta_reduce)
    (expression
      (string)
    )
    (block_end)
  )
)
